АлогистикТест2/src/Documents/алк_СкладскиеОперации/алк_СкладскиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_СкладскиеОперации</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.алк_ВидыСкладскихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.алк_ОснованиеСкладскойОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_Производство</types>
      <types>DocumentRef.алк_Инвентаризация</types>
      <types>DocumentRef.алк_ТранспортировкаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оприходование</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ПроизводствоОборот/алк_ПроизводствоОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ПроизводствоОборот</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДвиженияПроизводства</name>
    <type>
      <types>EnumRef.алк_ВидыДвиженияПроизводствоОборот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПакетыПоАддендумам/алк_ПакетыПоАддендумам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПакетыПоАддендумам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Аддендум</name>
    <type>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_ВидыДвиженияПроизводствоОборот/алк_ВидыДвиженияПроизводствоОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыДвиженияПроизводствоОборот</name>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>Оприходовано</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/алк_ОперацииПроизводства/алк_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ОперацииПроизводства</name>
  <predefined>
    <items>
      <name>Досушка</name>
      <description>Досушка</description>
    </items>
    <items>
      <name>Дробление</name>
      <description>Дробление</description>
    </items>
    <items>
      <name>Лущение</name>
      <description>Лущение</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Отгрузка</name>
      <description>Отгрузка</description>
    </items>
    <items>
      <name>ОтгрузкаСудна</name>
      <description>Отгрузка судна</description>
    </items>
    <items>
      <name>ПереданоВОтгрузку</name>
      <description>Передано в отгрузку</description>
    </items>
    <items>
      <name>ПеремещениеПриход</name>
      <description>Перемещение приход</description>
    </items>
    <items>
      <name>ПеремещениеРасход</name>
      <description>Перемещение расход</description>
    </items>
    <items>
      <name>Пересортица</name>
      <description>Пересортица</description>
    </items>
    <items>
      <name>Переупаковка</name>
      <description>Переупаковка</description>
    </items>
    <items>
      <name>Прибыло</name>
      <description>Прибыло</description>
    </items>
    <items>
      <name>Приемка</name>
      <description>Приемка</description>
    </items>
    <items>
      <name>ПриемкаВПорту</name>
      <description>Приемка в порту</description>
    </items>
    <items>
      <name>ПриемкаПоГОСТ</name>
      <description>Приемка по ГОСТ</description>
    </items>
    <items>
      <name>ПроизводствоПоддонов</name>
      <description>Производство поддонов</description>
    </items>
    <items>
      <name>ПроизводствоТопливныхБрикетов</name>
      <description>Производство топливных брикетов</description>
    </items>
    <items>
      <name>ПроизводствоФанеры</name>
      <description>Производство фанеры</description>
    </items>
    <items>
      <name>Разгружено</name>
      <description>Разгружено</description>
    </items>
    <items>
      <name>Распил</name>
      <description>Распил</description>
    </items>
    <items>
      <name>Ребросклей</name>
      <description>Ребросклей</description>
    </items>
    <items>
      <name>РучнаяСортировка</name>
      <description>Ручная сортировка</description>
    </items>
    <items>
      <name>СборкаРазборкаПакета</name>
      <description>Сборка/Разборка пакета</description>
    </items>
    <items>
      <name>Списание</name>
      <description>Списание</description>
    </items>
    <items>
      <name>Сушка</name>
      <description>Сушка</description>
    </items>
    <items>
      <name>Упаковка</name>
      <description>Упаковка</description>
    </items>
    <items>
      <name>УпаковкаФанеры</name>
      <description>Упаковка фанеры</description>
    </items>
    <items>
      <name>ФорматнаяОбрезка</name>
      <description>Форматная обрезка</description>
    </items>
    <items>
      <name>ЧисленныйСоставСмены</name>
      <description>Численный состав смены (общая)</description>
    </items>
    <items>
      <name>ШлифованиеФанеры</name>
      <description>Шлифование фанеры</description>
    </items>
  </predefined>
  <attributes>
    <name>ЗапросПолученияБюджета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияФакта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОперацииДляЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>63</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИтогов</name>
    <type>
      <types>EnumRef.алк_ВариантыИтогов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависитОтОпераций</name>
    <comment>Используется в механизме расчета показателей для настраиваемых отчетов</comment>
    <attributes>
      <name>ОперацияПроизводства</name>
      <type>
        <types>CatalogRef.алк_ОперацииПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеВТ</name>
    <attributes>
      <name>ВТ</name>
      <type>
        <types>CatalogRef.алк_ВТ_ДляРасчетаПоказателейПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_СкладскиеОперации/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	ПодготовитьДанныеДляРНОстаткиЗапасов(ДокументСсылка, ДополнительныеСвойства);
	ПодготовитьДанныеДляРНПроизводствоОборот(ДокументСсылка, ДополнительныеСвойства);
КонецПроцедуры

Процедура ПодготовитьДанныеДляРНОстаткиЗапасов(ДокументСсылка, ДополнительныеСвойства)
	
	Запрос = новый запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ОстаткиЗапасов.Период,
	|	алк_ОстаткиЗапасов.ВидДвижения,
	|	алк_ОстаткиЗапасов.Организация,
	|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
	|	алк_ОстаткиЗапасов.Штабель,
	|	алк_ОстаткиЗапасов.Номенклатура,
	|	алк_ОстаткиЗапасов.Характеристика,
	|	алк_ОстаткиЗапасов.Сертификат,
	|	алк_ОстаткиЗапасов.СерийныйНомер,
	|	алк_ОстаткиЗапасов.Количество
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	|ГДЕ
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_СкладскиеОперацииСписание.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	алк_СкладскиеОперацииСписание.Ссылка.Организация,
	|	алк_СкладскиеОперацииСписание.Ссылка.Склад,
	|	алк_СкладскиеОперацииСписание.Ссылка.Штабель,
	|	алк_СкладскиеОперацииСписание.Номенклатура,
	|	алк_СкладскиеОперацииСписание.Характеристика,
	|	алк_СкладскиеОперацииСписание.Сертификат,
	|	алк_СкладскиеОперацииСписание.Ссылка.СерийныйНомер,
	|	алк_СкладскиеОперацииСписание.Количество
	|ИЗ
	|	Документ.алк_СкладскиеОперации.Списание КАК алк_СкладскиеОперацииСписание
	|ГДЕ
	|	алк_СкладскиеОперацииСписание.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_СкладскиеОперацииОприходование.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	алк_СкладскиеОперацииОприходование.Ссылка.Организация,
	|	алк_СкладскиеОперацииОприходование.Ссылка.Склад,
	|	алк_СкладскиеОперацииОприходование.Ссылка.Штабель,
	|	алк_СкладскиеОперацииОприходование.Номенклатура,
	|	алк_СкладскиеОперацииОприходование.Характеристика,
	|	алк_СкладскиеОперацииОприходование.Сертификат,
	|	алк_СкладскиеОперацииОприходование.Ссылка.СерийныйНомер,
	|	алк_СкладскиеОперацииОприходование.Количество
	|ИЗ
	|	Документ.алк_СкладскиеОперации.Оприходование КАК алк_СкладскиеОперацииОприходование
	|ГДЕ
	|	алк_СкладскиеОперацииОприходование.Ссылка = &ДокументСсылка");
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", ТаблицаДвижений);

КонецПроцедуры

Процедура ПодготовитьДанныеДляРНПроизводствоОборот(ДокументСсылка, ДополнительныеСвойства)
	
	Запрос = новый запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ПроизводствоОборот.Период,
	|	алк_ПроизводствоОборот.Организация,
	|	алк_ПроизводствоОборот.Склад,
	|	алк_ПроизводствоОборот.Номенклатура,
	|	алк_ПроизводствоОборот.Характеристика,
	|	алк_ПроизводствоОборот.Сертификат,
	|	алк_ПроизводствоОборот.СерийныйНомер,
	|	алк_ПроизводствоОборот.Количество,
	|	алк_ПроизводствоОборот.Операция,
	|	алк_ПроизводствоОборот.Участок,
	|	алк_ПроизводствоОборот.Бригада,
	|	алк_ПроизводствоОборот.ДатаСмены,
	|	алк_ПроизводствоОборот.Смена,
	|	алк_ПроизводствоОборот.ВидДвиженияПроизводства
	|ИЗ
	|	РегистрНакопления.алк_ПроизводствоОборот КАК алк_ПроизводствоОборот
	|ГДЕ
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_СкладскиеОперацииСписание.Ссылка.Дата,
	|	алк_СкладскиеОперацииСписание.Ссылка.Организация,
	|	алк_СкладскиеОперацииСписание.Ссылка.Склад,
	|	алк_СкладскиеОперацииСписание.Номенклатура,
	|	алк_СкладскиеОперацииСписание.Характеристика,
	|	алк_СкладскиеОперацииСписание.Сертификат,
	|	алк_СкладскиеОперацииСписание.Ссылка.СерийныйНомер,
	|	ВЫБОР
	|		КОГДА алк_СкладскиеОперацииСписание.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_видыСкладскихОпераций.Пересортица)
	|			ТОГДА -алк_СкладскиеОперацииСписание.Количество
	|		ИНАЧЕ алк_СкладскиеОперацииСписание.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА алк_СкладскиеОперацииСписание.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_видыСкладскихОпераций.Пересортица)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Пересортица)
	|		КОГДА алк_СкладскиеОперацииСписание.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_видыСкладскихОпераций.ПересортицаНеПакетируемого)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Пересортица)
	|		КОГДА алк_СкладскиеОперацииСписание.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_видыСкладскихОпераций.Списание)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Списание)
	|		КОГДА алк_СкладскиеОперацииСписание.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_видыСкладскихОпераций.СписаниеНеПакетируемого)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Списание)
	|	КОНЕЦ,
	|	алк_СкладскиеОперацииСписание.Ссылка.Участок,
	|	NULL,
	|	алк_СкладскиеОперацииСписание.Ссылка.ДатаСмены,
	|	алк_СкладскиеОперацииСписание.Ссылка.Смена,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано)
	|ИЗ
	|	Документ.алк_СкладскиеОперации.Списание КАК алк_СкладскиеОперацииСписание
	|ГДЕ
	|	алк_СкладскиеОперацииСписание.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_СкладскиеОперацииОприходование.Ссылка.Дата,
	|	алк_СкладскиеОперацииОприходование.Ссылка.Организация,
	|	алк_СкладскиеОперацииОприходование.Ссылка.Склад,
	|	алк_СкладскиеОперацииОприходование.Номенклатура,
	|	алк_СкладскиеОперацииОприходование.Характеристика,
	|	алк_СкладскиеОперацииОприходование.Сертификат,
	|	алк_СкладскиеОперацииОприходование.Ссылка.СерийныйНомер,
	|	алк_СкладскиеОперацииОприходование.Количество,
	|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Пересортица),
	|	алк_СкладскиеОперацииОприходование.Ссылка.Участок,
	|	NULL,
	|	алк_СкладскиеОперацииОприходование.Ссылка.ДатаСмены,
	|	алк_СкладскиеОперацииОприходование.Ссылка.Смена,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)
	|ИЗ
	|	Документ.алк_СкладскиеОперации.Оприходование КАК алк_СкладскиеОперацииОприходование
	|ГДЕ
	|	алк_СкладскиеОперацииОприходование.Ссылка = &ДокументСсылка
	|	И алк_СкладскиеОперацииОприходование.Ссылка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.алк_видыСкладскихОпераций.Пересортица), ЗНАЧЕНИЕ(Перечисление.алк_видыСкладскихОпераций.ПересортицаНеПакетируемого), ЗНАЧЕНИЕ(Перечисление.алк_видыСкладскихОпераций.ОприходованиеНеПакетируемого))");
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот", ТаблицаДвижений);

КонецПроцедуры


// Выполняет движения регистра накопления алк_ОстаткиЗапасов.
//
Процедура ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПроизводствоОборот = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПроизводствоОборот;
	
	Если Отказ
		ИЛИ ТаблицаПроизводствоОборот.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗапасыОрганизации = Движения.алк_ПроизводствоОборот;
	ДвиженияЗапасыОрганизации.Записывать = Истина;
	ДвиженияЗапасыОрганизации.Загрузить(ТаблицаПроизводствоОборот);
	
КонецПроцедуры

Процедура ВыполнитьКонтрольИспользованияПакетаВАддендуме(СерийныйНомер, Дата, Отказ) Экспорт
	
	СтруктураАддендума = РегистрыСведений.алк_ПакетыПоАддендумам.ПолучитьАддендумИСтатусПоОтгрузкеПоСерийномуНомеруНаДату(СерийныйНомер, Дата); 
	
	Если СтруктураАддендума = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Аддендум = СтруктураАддендума.Адд;
	АддендумПоОтгрузке = СтруктураАддендума.ПоОтгрузке;
	
	//если отвязали адд, либо был отгружен, но есть на остатках, то проводим
	Если НЕ ЗначениеЗаполнено(Аддендум) ИЛИ АддендумПоОтгрузке Тогда 
		Возврат;
	КонецЕсли;
	//\\
	
	Сообщить(СтрШаблон("Серийный номер №%1 привязан к документу %2. Прежде чем выполнять операции с этим пакетом, его необходимо отвязать от Аддендума", 
	СерийныйНомер, Аддендум));
	Отказ = Истина;
	
КонецПроцедуры
